package Les10.Word_Palindrome;

public class Main {

	public static void main(String[] args) {

		/*
		 * Створити програму, яка буде перевіряти, чи є слово з п'яти букв, введене
		 * користувачем,
		 * 
		 * паліндромом (приклади: «пилип», «ротор»). Якщо введено слово не з 5 букв, то
		 * 
		 * повідомляти про помилку. Програма повинна нормально обробляти слово, навіть
		 * якщо в
		 * 
		 * ньому використані символи різного регістру. Наприклад, слова «Комок» або
		 * «РОТОР» слід
		 * 
		 * також вважати паліндромами.
		 * 
		 * Максимум:
		 * 
		 * 3. Порахувати кількість слів у реченні. (Речення довільне)
		 * 
		 * 4. Знайти слово яке найчастіше зустрічається в реченні.
		 */

		System.out.println("Введіть слово із 5 літер: ");
		Palindrome pl = new Palindrome();
		pl.check();
		
	}

}
