package Les8.Enums;

public class Main {

	public static void main(String[] args) {

		/*
		 * Ќаписати консольну програму дл€ роботи з Enums.
		 * 
		 * —творити енум —езони, в €кому оголосити так≥ константи : «има , ¬есна, Ћ≥то,
		 * ќс≥нь.
		 * 
		 * —творити енум ћ≥с€ц≥, в €кому створити 12 констант- м≥с€ц≥ року(—≥чень ,
		 * Ћютий.. √рудень ), оголосити зм≥нну дн≥, та зм≥нну сезон типу —езон , €к поле
		 * енума . —творити конструктор з визначеними параметрами в енум≥ ћ≥с€ц≥, в €кий
		 * €к параметри передати зм≥нну дн≥ та сезон. ќписати getters до даних пол≥в
		 * (дн≥, сезони). —творити консольне меню, в €кому реал≥зувати наступн≥ пункти :
		 * 
		 * Ч ѕерев≥рити чи Ї такий м≥с€ць (м≥с€ць вводимо з консол≥, передбачити, щоб
		 * рег≥стр букв був не важливим ) Ч ¬ивести вс≥ м≥с€ц≥ з такою ж порою року Ч
		 * ¬ивести вс≥ м≥с€ц≥ €к≥ мають таку саму к≥льк≥сть дн≥в Ч ¬ивести на екран вс≥
		 * м≥с€ц≥ €к≥ мають меншу к≥льк≥сть дн≥в Ч ¬ивести на екран вс≥ м≥с€ц≥ €к≥ мають
		 * б≥льшу к≥льк≥сть дн≥в Ч ¬ивести на екран наступну пору року Ч ¬ивести на
		 * екран попередню пору року Ч ¬ивести на екран вс≥ м≥с€ц≥ €к≥ мають парну
		 * к≥льк≥сть дн≥в Ч ¬ивести на екран вс≥ м≥с€ц≥ €к≥ мають непарну к≥льк≥сть дн≥в
		 * Ч ¬ивести на екран чи введений з консол≥ м≥с€ць маЇ парну к≥льк≥сть дн≥в
		 */
		
		ConsoleMenu cMenu = new ConsoleMenu();
		cMenu.menu();

	}

}
