package Les3.Rectangle;

public class Main {

	public static void main(String[] args) {

		/*Створити клас Rectangle , в якому буде оголошено поля : довжина, ширина. 
		 * В ньому створити конструктор з параметрами і без параметрів. 
		 * В конструкторі без параметрів оголосити свої дані. Тобто створюючи об’єкт, 
		 * за вибору даного конструктору, ви отримаєте прямокутник даного розміру. 
		 * Оголосити методи, які будуть розраховувати площу та периметр. 
		 * В Main класі продемонструвати створення об’єктів використовуючи два конструктори. 
		 * Вивести на консоль площу і периметр прямокутника. Вивід на консолі повинен 
		 * мати наступний вигляд: «Площа прямокутника = тут буде площа», 
		 * «Периметр прямокутника = тут буде периметр» . */
		
		Rectangle rectangle1 = new Rectangle();
		rectangle1.area();
		rectangle1.perimeter();
		System.out.println("--------------------------");
		Rectangle rectangle2 = new Rectangle(60, 20);
		rectangle2.area();
		rectangle2.perimeter();

	}

}
