package Les4.Animals;

public class Main {

	public static void main(String[] args) {

		/* Створити клас Тварина. Описати його такими полями: назва тварини, швидкість
		 * тварини, вік тварини. Дані поля повинні бути приватними.
		 * Створити конструктор з визначеними параметрами, в який необхідно ввести всі
		 * поля класу. Створити getters/setters до всіх полів класу. В методі мейн.
		 * Створити екземпляр даного класу, за допомогою getter вивести на консоль в
		 * один рядок значення полів даного класу. Викликати setter, змінити значення
		 * всіх полів класу. Вивести на консоль всі поля класу, знову в один рядок.
		 * Значення полів довільні. В методі мейн повинен бути створений лише один обєкт
		 * класу Тварина. Вивід повинен бути написаний наступним чином:
		 * "Назва тварини = Леопард, Швидкість тварини = 20 км/год, Вік тварини = 7 років "
		 * "-------------------------"
		 * "Назва тварини = Бик, Швидкість тварини = 2 км/год, Вік тварини = 14 років "
		 */
		
		Animals animals = new Animals("Леопард", 20, 7);
		System.out.println(animals);
		animals.point();
		animals.setName("Бик");
		animals.setSpeed(2);
		animals.setAge(14);
		System.out.println("Назва тварини = " + animals.getName()+ ", Швидкість тварини = " + animals.getSpeed()+ 
				"км/год, Вік тварини = " + animals.getAge());
		animals.point();
	}

}
